In [1]:
import pandas as pd
import numpy as np

In [22]:
people = {
    'first' : ['Jane', 'Mark', 'Sue', 'Chris', np.nan, None, 'NA'],
    'last' : ['Horse', 'John', 'Hill', 'Doe', 'Doe', np.nan, 'Missing'],
    'email' : ['janehorse@gmail.com', 'markjohn@gmail.com', 'suehill@email.com', 'chrisdoe@gmail.com', None, np.nan, 'NA'],
    'age': ['33','55', '63', '36', None, None, 'Missing']
    }

In [33]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [34]:
df

   first   last                email   age
0   Jane  Horse  janehorse@gmail.com    33
1   Mark   John   markjohn@gmail.com    55
2    Sue   Hill    suehill@email.com    63
3  Chris    Doe   chrisdoe@gmail.com    36
4    NaN    Doe                 None  None
5   None    NaN                  NaN  None
6    NaN    NaN                  NaN   NaN

In [35]:
df.dropna()

   first   last                email age
0   Jane  Horse  janehorse@gmail.com  33
1   Mark   John   markjohn@gmail.com  55
2    Sue   Hill    suehill@email.com  63
3  Chris    Doe   chrisdoe@gmail.com  36

In [36]:
df.dropna(axis='index', how='any')

   first   last                email age
0   Jane  Horse  janehorse@gmail.com  33
1   Mark   John   markjohn@gmail.com  55
2    Sue   Hill    suehill@email.com  63
3  Chris    Doe   chrisdoe@gmail.com  36

In [42]:
df.dropna(axis='index', how='all')

   first   last                email   age
0   Jane  Horse  janehorse@gmail.com    33
1   Mark   John   markjohn@gmail.com    55
2    Sue   Hill    suehill@email.com    63
3  Chris    Doe   chrisdoe@gmail.com    36
4    NaN    Doe                 None  None

In [38]:
df.dropna(axis='columns',how='all')

   first   last                email   age
0   Jane  Horse  janehorse@gmail.com    33
1   Mark   John   markjohn@gmail.com    55
2    Sue   Hill    suehill@email.com    63
3  Chris    Doe   chrisdoe@gmail.com    36
4    NaN    Doe                 None  None
5   None    NaN                  NaN  None
6    NaN    NaN                  NaN   NaN

In [39]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [40]:
df.dropna(axis='index',how='any', subset=['email'])

   first   last                email age
0   Jane  Horse  janehorse@gmail.com  33
1   Mark   John   markjohn@gmail.com  55
2    Sue   Hill    suehill@email.com  63
3  Chris    Doe   chrisdoe@gmail.com  36

In [41]:
df.dropna(axis='index',how='all', subset=['last', 'email'])

   first   last                email   age
0   Jane  Horse  janehorse@gmail.com    33
1   Mark   John   markjohn@gmail.com    55
2    Sue   Hill    suehill@email.com    63
3  Chris    Doe   chrisdoe@gmail.com    36
4    NaN    Doe                 None  None

In [43]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4   True  False   True   True
5   True   True   True   True
6   True   True   True   True

In [44]:
df.fillna('MISSING')

     first     last                email      age
0     Jane    Horse  janehorse@gmail.com       33
1     Mark     John   markjohn@gmail.com       55
2      Sue     Hill    suehill@email.com       63
3    Chris      Doe   chrisdoe@gmail.com       36
4  MISSING      Doe              MISSING  MISSING
5  MISSING  MISSING              MISSING  MISSING
6  MISSING  MISSING              MISSING  MISSING

In [46]:
df.fillna(0)

   first   last                email age
0   Jane  Horse  janehorse@gmail.com  33
1   Mark   John   markjohn@gmail.com  55
2    Sue   Hill    suehill@email.com  63
3  Chris    Doe   chrisdoe@gmail.com  36
4      0    Doe                    0   0
5      0      0                    0   0
6      0      0                    0   0

In [47]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [48]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [49]:
type(np.nan)

float

In [50]:
df['age'] = df['age'].astype(float)

In [51]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [52]:
df['age'].mean()

46.75